# Домашнее задание к занятию "7. Коллекции"

### Описание.

Вам необходимо написать три класса (можно как приватные внутри *Program.cs*), в каждом из которых лежит реализация задачи. В методе Main предложить пользователю выбрать номер задачи. Выполнение задачи - в отдельном методе (пример шаблона см. ниже). Главное - у каждого класса должен быть публичный метод *TaskLoop()* , внутри которого происходит выполнение программы.  
Задания
1. Создайте список строк (List<string>) и добавьте в него несколько элементов. Затем попросите пользователя ввести новую строку и добавьте ее в список. Выведите содержимое списка на экран. Попросите пользователя ввести ещё одну строку, и добавьте её в середину списка
2. Напишите программу, которая создает словарь, связывая имена студентов с их средними оценками. Попросите пользователя ввести имя студента и его оценку. Обязательно сделайте проверку на корректность ввода оценки: она должна быть от 2 до 5. Затем попросите пользователя ввести имя студента, и выведите оценку. Если студента нет в словаре, напишите, что студента с таким именем не существует.
3. Мы познакомились с простой реализацией односвязного списка. Дополните её, чтобы получился двусвзяный список. Предложите пользователю создать список, ввести от 3 до 6 элементов, через *ReadLine*, можно воспользоваться циклом для ввода данных.  Затем вывести список в прямом и обратном порядках.


Шаблон программы
```csharp
namespace HomeWork
{
    internal class Program
    {
        private class ListTask 
        {
            private readonly List<int> _listOfInts; // Тип данных любой

            public void TaskLoop() 
            {
                // проверка ввода и вывод результата
            }
        }

        private class LinkedListTask
        {
            private class Node { } // Узел списка

            public void TaskLoop()
            {
                // проверка ввода и вывод результата
            }
        }

        static void Main(string[] args)
        {
		    Console.WriteLine("Enter 1,2 or 3 to check task 1,2 or 3");
            int task = int.Parse(Console.ReadLine()); // Используйте tryParse
            switch (task) 
            {
                case 1:
                    CheckTaskFirst(); // Выполнение задания в отдельном методе
                    break;
            }
        }

        private static void CheckTaskFirst()
        {
            var listTask = new ListTask();
            listTask.TaskLoop();
        }
    }
}
```

Код можно сбросить файлом, либо используйте Pastebin`https://pastebin.com/`
Либо создать репозиторий. Здесь уже на ваше усмотрение.
