# Домашнее задание к занятию "4. Циклы"

### Описание.

Вам необходимо внутри static void Main(string[] args) написать решение 4 задач. Можно использовать операторы верхнего уровня (шаблон программы без class Program)

1. С помощью цикла for (или while) выведите первые 10 чисел Фиббоначи (см. Задание из 3 урока)
2. Используя цикл for, выведите все чётные числа от 2 до 20
3. С помощью вложенных циклов for выведите таблицу умножения от 1 до 5. Каждая строка таблицы должна быть выведена в отдельной строке.  Тоесть:

1 2 3 4 5 - умножение на 1  
2 4 6 8 10 - умножение на 2  
... т.д.
   
4. Дана строка string password = "qwerty"; Напишите программу для ввода пароля, которая считывает пользовательский ввод Console.ReadLine. Подсказка: используйте do-while

Шаблон программы
```csharp
namespace HomeWork
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // Fibonaccy
            for (; ; ) { } // пример. Цикл может быть любой, если в задаче не указано, какой использовать
            // для вывода используйте Console.WriteLine
        }
    }
}
```

Код можно сбросить файлом, либо используйте Pastebin`https://pastebin.com/`
