# Домашнее задание к занятию "4. Циклы"

### Описание.

Вам необходимо написать 4 метода, в каждом из которых будет решение задачи

1. Напишите программу, используя циклы, для вывода первых 10 чисел Фиббоначи (см. Задание из 3 урока)
2. Напишите программу, используя цикл for, для вывода всех чётных чисел от 2 до 20
3. Создайте программу, которая использует вложенные циклы для вывода таблицы умножения от 1 до 5. Каждая строка таблицы должна быть выведена в отдельной строке.
4. Дана строка string password = "qwerty"; Напишите программу для ввода пароля, которая считывает пользовательский ввод Console.ReadLine. Подсказка: используйте do-while

Шаблон программы
```csharp
namespace HomeWork
{
    internal class Program
    {
        private static void Fibonaccy() 
        {
            for (; ; ) { } // пример. Цикл может быть любой, если в задаче не указано, какой использовать
            // для вывода используйте Console.WriteLine

        }

        private static void Even() 
        {
            for (; ; ) { } // аналогично
        }

        private static void Table() { }

        private static void Password() 
        {
            string password = "qwerty"; // пароль задаётся в начале
            //в цикле проверяется ввод и выводится результат
        }

        static void Main(string[] args)
        {
            Fibonaccy();
            Even();
            Table();
            Password();
        }
    }
}
```

Код можно сбросить файлом, либо используйте Pastebin`https://pastebin.com/`
При создании консольного проекта можно использовать операторы верхнего уровня. 